wallet-soap/tests/Managers/stubs/wsdl.xml

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://wallet-soap.local/api/wallet/server" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="WalletService" targetNamespace="http://wallet-soap.local/api/wallet/server"><types><xsd:schema targetNamespace="http://wallet-soap.local/api/wallet/server"><xsd:complexType name="ApiResponse"><xsd:all><xsd:element name="success" type="xsd:boolean"/><xsd:element name="cod_error" type="xsd:string"/><xsd:element name="message_error" type="xsd:string"/><xsd:element name="data" type="xsd:anyType"/></xsd:all></xsd:complexType></xsd:schema></types><portType name="WalletServicePort"><operation name="customerRegistration"><documentation>This method registers a new customer using their document ID, name, email, and phone number.</documentation><input message="tns:customerRegistrationIn"/><output message="tns:customerRegistrationOut"/></operation><operation name="recharge"><documentation>This method processes a wallet recharge for the customer using their document ID and phone number.</documentation><input message="tns:rechargeIn"/><output message="tns:rechargeOut"/></operation><operation name="payment"><documentation>This method processes a payment by deducting the specified amount from the customer's wallet.</documentation><input message="tns:paymentIn"/><output message="tns:paymentOut"/></operation><operation name="paymentConfirmation"><documentation>This method confirms a payment by verifying the session ID and token associated with the transaction.</documentation><input message="tns:paymentConfirmationIn"/><output message="tns:paymentConfirmationOut"/></operation><operation name="balanceInquiry"><documentation>This method allows the customer to check their wallet balance by providing their document ID and contact details.</documentation><input message="tns:balanceInquiryIn"/><output message="tns:balanceInquiryOut"/></operation></portType><binding name="WalletServiceBinding" type="tns:WalletServicePort"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="customerRegistration"><soap:operation soapAction="http://wallet-soap.local/api/wallet/server#customerRegistration"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></output></operation><operation name="recharge"><soap:operation soapAction="http://wallet-soap.local/api/wallet/server#recharge"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></output></operation><operation name="payment"><soap:operation soapAction="http://wallet-soap.local/api/wallet/server#payment"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></output></operation><operation name="paymentConfirmation"><soap:operation soapAction="http://wallet-soap.local/api/wallet/server#paymentConfirmation"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></output></operation><operation name="balanceInquiry"><soap:operation soapAction="http://wallet-soap.local/api/wallet/server#balanceInquiry"/><input><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></input><output><soap:body use="encoded" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://wallet-soap.local/api/wallet/server"/></output></operation></binding><service name="WalletServiceService"><port name="WalletServicePort" binding="tns:WalletServiceBinding"><soap:address location="http://wallet-soap.local/api/wallet/server"/></port></service><message name="customerRegistrationIn"><part name="documentId" type="xsd:string"/><part name="name" type="xsd:string"/><part name="email" type="xsd:string"/><part name="phone" type="xsd:string"/></message><message name="customerRegistrationOut"><part name="return" type="tns:ApiResponse"/></message><message name="rechargeIn"><part name="documentId" type="xsd:string"/><part name="phone" type="xsd:string"/><part name="amount" type="xsd:int"/></message><message name="rechargeOut"><part name="return" type="tns:ApiResponse"/></message><message name="paymentIn"><part name="documentId" type="xsd:string"/><part name="phone" type="xsd:string"/><part name="amount" type="xsd:int"/></message><message name="paymentOut"><part name="return" type="tns:ApiResponse"/></message><message name="paymentConfirmationIn"><part name="sessionId" type="xsd:string"/><part name="token" type="xsd:string"/></message><message name="paymentConfirmationOut"><part name="return" type="tns:ApiResponse"/></message><message name="balanceInquiryIn"><part name="documentId" type="xsd:string"/><part name="phone" type="xsd:string"/></message><message name="balanceInquiryOut"><part name="return" type="tns:ApiResponse"/></message></definitions>
